---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Side0
enum: Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType
source: html/71dafbc2-6ff2-5931-9d31-66f206a65476.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Side0

Face forms the exterior surface of the host geometry.